Autodesk.Revit.DB.Mechanical.Zone.RemoveSpaces(Autodesk.Revit.DB.Mechanical.SpaceSet)
Remove a set of existing spaces to the current Zone element.
spaces:  The spaces which want to delete from the current zone element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter Value is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the input spaces cannot be deleted from current zone element.
Returns:  If successful the current zone element will remove a set of input spaces, otherwise null.

Autodesk.Revit.DB.Mechanical.Zone.AddSpaces(Autodesk.Revit.DB.Mechanical.SpaceSet)
Add a set of existing spaces to Zone element.
spaces:  The spaces which want to add to zone element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter Value is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the input spaces cannot be added to current zone element.
Returns:  If successful the current zone element will add a set of input spaces, otherwise null.

Autodesk.Revit.DB.Mechanical.Zone.DehumidificationSetPoint
Get or set the DeHumidification Set Point of the Zone.
Remarks: This property is used to get or set the DeHumidification Set Point of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.HumidificationSetPoint
Get or set the Humidification Set Point of the Zone.
Remarks: This property is used to get or set the Humidification Set Point of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.CoolingAirTemperature
Get or set the Cooling Air Temperature of the Zone.
Remarks: This property is used to get or set the Cooling Air Temperature of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.HeatingAirTemperature
Get or set the Heating Air Temperature of the Zone.
Remarks: This property is used to get or set the Heating Air Temperature of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.CoolingSetPoint
Get or set the Cooling Set Point of the Zone.
Remarks: This property is used to get or set the Cooling Set Point of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.HeatingSetPoint
Get or set the Heating Set Point of the Zone.
Remarks: This property is used to get or set the Heating Set Point of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.CalculatedCoolingLoad
Get the Calculated Cooling Load of the Zone.
Remarks: This property is used to get the Calculated Cooling Load of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.CalculatedHeatingLoad
Get the Calculated Heating Load of the Zone.
Remarks: This property is used to get the Calculated Heating Load of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.CalculatedSupplyAirflow
Get the Calculated Supply Airflow of the Zone.
Remarks: This property is used to get the Calculated Supply Airflow (Unit: Airflow ) of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.ServiceType
Get or set the Service Type of the Zone.
Remarks: This property is used to get or set the Service Type of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.Boundary
Returns the boundary of the Zone.
Remarks: This property is used to retrieve the segments that constitute the boundary of the Zone.
Each Zone may have several regions, each of which have several segments hence the data is returned
in the form of an array of boundary segment arrays. See the Zone.BoundarySegment object for more
details about the segments that make up the Zone topology.

Autodesk.Revit.DB.Mechanical.Zone.Spaces
Get the Spaces of the Zone.
Remarks: This property is used to get the Spaces of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.Perimeter
Get the Perimeter of the Zone.
Remarks: This property is used to get the Perimeter of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.GrossVolume
Get the Gross Volume of the Zone.
Remarks: This property is used to get the Gross Volume of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.Volume
Get the Volume of the Zone.
Remarks: This property is used to get the Volume of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.GrossArea
Get the Gross Area of the Zone.
Remarks: This property is used to get the Gross Area of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.Area
Get the Area of the Zone.
Remarks: This property is used to get the Area of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.IsDefaultZone
Reports whether this zone is default or not.
Remarks: This property can be used to set the current zone as the default zone.

Autodesk.Revit.DB.Mechanical.Zone.Phase
Get the Phase of the Zone.
Remarks: This property is used to get the Phase of the Zone.

Autodesk.Revit.DB.Mechanical.Zone.Name
Get or Set the Name of the Zone.
Remarks: This property is used to get or set the Name of the Zone.

Autodesk.Revit.DB.Mechanical.Zone
Provides access to the Zone Element in Autodesk Revit.
Remarks: This object derived from the Element base object and such supports all the
methods of that object such as the ability to retrieve the parameters of that object. This
object is only available in Revit MEP.